/*
진수 사용
진수 : 서로 다른 모양(2진수, 8진수 등)의 숫자 몇 개를 가지고 모든 수를 표현
코딩에서 진수 사용법
10진수(Decimal) : 숫자 //0123456789/10 11 12 13....
8진수(Octal) : 0숫자 //01234567/10 11 12 13 14 15 16 17/20 21....
16진수(Hex) : 0x숫자 //0123456789abcdef/10 11 12...1a 1b....
                         10 11 12 13 14 15
2진수(Binary) //01
*/
package day1228;
class Radix {
	
	public static void main(String[] args) {
		/*
		..배씩 늘어남..256 / 128 / 64 / 32 / 16 / 8 / 4 / 2 / 1
		OOOO OOOO

		10진수를 2진수로 바꾸기 //2의 배수를 합해서 값만들기(각 자리x)
		25 = 11001
		89 = 1011001
		300 = 100101100
		*/

		int i = 10;//10진수 -> 2진수로 저장
		int j = 012;//8진수 -> 2진수로 저장
		int k = 0xa;//16진수 -> 2진수로 저장 //ex)10진수 1190 = 16진수 4a6 = java 0x4a6

		System.out.println(i+j+k); //2진수를 연산하여 10진수로 보여줌

		System.out.println(Integer.toBinaryString(300));//10진수를 2진수로 바꾸기
//////////////////////////////////////////////////////////////////////////////////////////////////////////////
		/*
		8진수를 2진수로 바꾸기
		025
		4/2/1
		5 -> 101(4+1)
		2 -> 010(2)
		0001 0101 (16+4+1=21(10진수로 21))

		030 = 11000 //숫자 맞춰 넣고 3자리중 나머지에 0 넣기
		0201 = 1000 0001
		0300 = 1100 0000
		*/

		System.out.println(Integer.toBinaryString(030));//8진수를 2진수로 바꾸기
		System.out.println(Integer.toBinaryString(0201));//8진수를 2진수로 바꾸기
		System.out.println(Integer.toBinaryString(0300));//8진수를 2진수로 바꾸기
		
		//10진수를 8진수로 바꾸기
		System.out.println(Integer.toOctalString(300));
//////////////////////////////////////////////////////////////////////////////////////////////////////////////
		/*
		16진수를 2진수로 바꾸기
		숫자 하나당 8/4/2/1
		0x2b
		0010 1011
		0x5c
		0101 1100

		0x25
		0010 0101
		0x1d 13
		0001 1101
		0xff 15
		1111 1111
		*/
//////////////////////////////////////////////////////////////////////////////////////////////////////////////	

		//10진수를 16진수로 바꾸기
		System.out.println(Integer.toHexString(37));

//////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//16진수를 2진수로 바꾸기
		System.out.println("0x25를 2진수로 : " + 
				Integer.toBinaryString(0x25));//16진수를 2진수로 바꾸기
		System.out.println("0x1d를 2진수로 : " +
				Integer.toBinaryString(0x1d));//16진수를 2진수로 바꾸기
		System.out.println("0xff를 2진수로 : " +
				Integer.toBinaryString(0xff));//16진수를 2진수로 바꾸기

		/*
		2진수 음수 표현 - 보수법(맨 앞 1) 사용. 전체 1에 빠지는 곳에 0
		맨 앞 : 0 양수 / 1 음수
		0 : 0000 0000 -1 : 1111 1111
		1 : 0000 0001 -2 : 1111 1110
		2 : 0000 0010 -3 : 1111 1101
		...
		0000 1100 : 12 / 1111 0011 : -13(-(12+1))
		*/

		
	}//main
}//class
